EXAMPLE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.01)
    (0.1 0 -0.01)
    (0.1 1.27 -0.01)
    (0 1.27 -0.01)
    (0 0 0.01)
    (0.1 0 0.01)
    (0.1 1.27 0.01)
    (0 1.27 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 300 1)

    simpleGrading
    (
        (
            (0.05 0.2 10)
            (0.9 0.6 1)
            (0.05 0.2 0.1)
        )
        1
        1
    )
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    empty frontAndBackPlanes
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
