EXAMPLE/0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               noSlip;
    }

    outlet
    {
        type               zeroGradient;
    }

    walls
    {
        type                    JohnsonJacksonParticleSlip;
        restitutionCoefficient  0.8;
        specularityCoefficient  0.6;
        muF                     0.25;
        sigma                   2;
        value                   uniform (0 0 0);
    }

    frontAndBackPlanes
    {
        type               empty;
    }
}

// ************************************************************************* //
