EXAMPLE/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.particles 0.0
    volScalarFieldValue rhoq 0.0
);

regions
(
    boxToCell
    {
        box (0 0 -0.1) (0.1 0.5 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.particles 0.5
            volScalarFieldValue rhoq -0.14e-3
        );
    }
);


// ************************************************************************* //
